[Killed] BlockStatement
components/Auth/Login/LoginOptions.js:17:27
 
 class LoginOptions extends Component {
   // logs user in through google
-  handleGoogleAuth = e => {
-    e.preventDefault();
-    this.props.googleLogin();
-  };
+  handleGoogleAuth = e => {};
 
   // logs user in through facebook

[Killed] BlockStatement
components/Auth/Login/LoginOptions.js:23:29
   };
 
   // logs user in through facebook
-  handleFacebookAuth = e => {
-    e.preventDefault();
-    this.props.facebookLogin();
-  };
+  handleFacebookAuth = e => {};
   render() {
     const { path } = this.props;
