[Survived] BlockStatement
project/nutrition-tracker-fe/src/App.js:21:12
 // import RequireAuth from "./components/Auth";
 
 class App extends Component {
-  render() {
-    return (
-      <AppWrapper>
-        <PrivateRoute exact path="/" component={DailyLog} />
-        <Route path="/landing" component={LandingPage} />
-        <Route path="/login" component={Login} />
-        <Route path="/register" component={Register} />
-        <Route path="/onboarding" component={Onboarding} />
-      </AppWrapper>
-    );
-  }
+  render() {}
 }
 
