[Killed] BlockStatement
components/Auth/Login/LoginWithEmail.js:18:28
   };
 
   // Life is change, you need to know how to handle it
-  handleInputChange = e => {
-    this.setState({
-      ...this.state,
-      [e.target.name]: e.target.value
-    });
-  };
+  handleInputChange = e => {};
 
   // does the login thing, ya know?

[Killed] ObjectLiteral
components/Auth/Login/LoginWithEmail.js:19:19
 
   // Life is change, you need to know how to handle it
   handleInputChange = e => {
-    this.setState({
-      ...this.state,
-      [e.target.name]: e.target.value
-    });
+    this.setState({});
   };
 

[Killed] BlockStatement
components/Auth/Login/LoginWithEmail.js:26:22
   };
 
   // does the login thing, ya know?
-  handleLogin = e => {
-    e.preventDefault();
-    this.props.login(this.state.email, this.state.password);
-  };
+  handleLogin = e => {};
 
   render() {

[Killed] ObjectLiteral
components/Auth/Login/LoginWithEmail.js:75:30
 }
 
 export { LoginWithEmail };
-export default connect(null, { login })(LoginWithEmail);
+export default connect(null, {})(LoginWithEmail);
 
