[Survived] BlockStatement
src/components/DailyLog/index.js:16:23
 
 class DailyLog extends Component {
   // Offers the user a way out, a chance at a better life
-  handleLogout = e => {
-    e.preventDefault();
-    this.props.logout();
-  };
+  handleLogout = e => {};
 
   render() {

[Survived] ConditionalExpression
src/components/DailyLog/index.js:26:9
     const { user, pictureURL, loading, token } = this.props;
 
     // If data is not there but user is logged in, returns a loading screen
-    if (loading) return <Loading />;
+    if (false) return <Loading />;
 
     // If token isn't there then the user isn't logged in and send them back to wince they came

[Survived] ConditionalExpression
src/components/DailyLog/index.js:26:9
     const { user, pictureURL, loading, token } = this.props;
 
     // If data is not there but user is logged in, returns a loading screen
-    if (loading) return <Loading />;
+    if (true) return <Loading />;
 
     // If token isn't there then the user isn't logged in and send them back to wince they came

[Survived] BooleanLiteral
src/components/DailyLog/index.js:29:9
     if (loading) return <Loading />;
 
     // If token isn't there then the user isn't logged in and send them back to wince they came
-    if (!token) return <Redirect to="/landing" />;
+    if (token) return <Redirect to="/landing" />;
 
     // This is just placeholder till Daily log gets built out

[Survived] ConditionalExpression
src/components/DailyLog/index.js:29:9
     if (loading) return <Loading />;
 
     // If token isn't there then the user isn't logged in and send them back to wince they came
-    if (!token) return <Redirect to="/landing" />;
+    if (true) return <Redirect to="/landing" />;
 
     // This is just placeholder till Daily log gets built out

[Survived] BlockStatement
src/components/DailyLog/index.js:65:34
   border-radius: 50px;
 `;
 
-const mapStateToProps = state => {
-  return {
-    user: state.firebase.auth && state.firebase.auth.displayName,
-    pictureURL: state.firebase.auth.photoURL,
-    loading: !state.firebase.auth.isLoaded,
-    token:
-      state.firebase.auth &&
-      state.firebase.auth.stsTokenManager &&
-      state.firebase.auth.stsTokenManager.accessToken
-  };
-};
+const mapStateToProps = state => {};
 
 export default connect(mapStateToProps, { logout })(DailyLog);

[Survived] ObjectLiteral
src/components/DailyLog/index.js:66:10
 `;
 
 const mapStateToProps = state => {
-  return {
-    user: state.firebase.auth && state.firebase.auth.displayName,
-    pictureURL: state.firebase.auth.photoURL,
-    loading: !state.firebase.auth.isLoaded,
-    token:
-      state.firebase.auth &&
-      state.firebase.auth.stsTokenManager &&
-      state.firebase.auth.stsTokenManager.accessToken
-  };
+  return {};
 };
 

[Survived] LogicalOperator
src/components/DailyLog/index.js:67:11
 
 const mapStateToProps = state => {
   return {
-    user: state.firebase.auth && state.firebase.auth.displayName,
+    user: state.firebase.auth || state.firebase.auth.displayName,
     pictureURL: state.firebase.auth.photoURL,
     loading: !state.firebase.auth.isLoaded,

[Survived] ConditionalExpression
src/components/DailyLog/index.js:67:11
 
 const mapStateToProps = state => {
   return {
-    user: state.firebase.auth && state.firebase.auth.displayName,
+    user: false,
     pictureURL: state.firebase.auth.photoURL,
     loading: !state.firebase.auth.isLoaded,

[Survived] BooleanLiteral
src/components/DailyLog/index.js:69:14
   return {
     user: state.firebase.auth && state.firebase.auth.displayName,
     pictureURL: state.firebase.auth.photoURL,
-    loading: !state.firebase.auth.isLoaded,
+    loading: state.firebase.auth.isLoaded,
     token:
       state.firebase.auth &&

[Survived] ConditionalExpression
src/components/DailyLog/index.js:71:7
     pictureURL: state.firebase.auth.photoURL,
     loading: !state.firebase.auth.isLoaded,
     token:
-      state.firebase.auth &&
-      state.firebase.auth.stsTokenManager &&
-      state.firebase.auth.stsTokenManager.accessToken
+      true
   };
 };

[Survived] ConditionalExpression
src/components/DailyLog/index.js:71:7
     pictureURL: state.firebase.auth.photoURL,
     loading: !state.firebase.auth.isLoaded,
     token:
-      state.firebase.auth &&
-      state.firebase.auth.stsTokenManager &&
+      true &&
       state.firebase.auth.stsTokenManager.accessToken
   };
