[Killed] ConditionalExpression
components/Auth/Login/index.js:23:9
     const { isLoggedIn } = this.props;
 
     // If user is logged in on login page redirects them to protected route
-    if (isLoggedIn) return <Redirect to="/" />;
+    if (true) return <Redirect to="/" />;
 
     // Sets up routes for Login pages

[Killed] ConditionalExpression
components/Auth/Login/index.js:23:9
     const { isLoggedIn } = this.props;
 
     // If user is logged in on login page redirects them to protected route
-    if (isLoggedIn) return <Redirect to="/" />;
+    if (false) return <Redirect to="/" />;
 
     // Sets up routes for Login pages

[Killed] BlockStatement
components/Auth/Login/index.js:58:41
   }
 }
 
-export const mapStateToProps = state => {
-  return {
-    // when user is not logged in isEmpty is true
-    isLoggedIn: !state.firebase.auth.isEmpty
-  };
-};
+export const mapStateToProps = state => {};
 
 export {Login};
