[Survived] BlockStatement
components/Global/Loading/index.js:5:35
 
 import styled from "styled-components";
 
-export default function Loading() {
-  return (
-    <LoadingWrapper>
-      <h2>NutriJournal</h2>
-    </LoadingWrapper>
-  );
-}
+export default function Loading() {}
 
 const LoadingWrapper = styled.div`
