[Survived] BlockStatement
components/Global/TopBar/index.js:6:24
 import { BackSVG } from "../icons";
 import { Row, Col } from "../styled";
 
-function TopBar(props) {
-  const handleClick = () => {
-    props.history.goBack();
-  };
-
-  return (
-    <Row className="fixed-top" height="50px">
-      <Col
-        justify="center"
-        align="center"
-        style={{ flex: "0 0 50px" }}
-        onClick={handleClick}
-      >
-        <BackSVG />
-      </Col>
-      <Col justify="flex-start">
-        <PageTitle>{props.title}</PageTitle>
-      </Col>
-    </Row>
-  );
-}
+function TopBar(props) {}
 
 const PageTitle = styled.h1`

[Survived] BlockStatement
components/Global/TopBar/index.js:7:29
 import { Row, Col } from "../styled";
 
 function TopBar(props) {
-  const handleClick = () => {
-    props.history.goBack();
-  };
+  const handleClick = () => {};
 
   return (

[Survived] ObjectLiteral
components/Global/TopBar/index.js:16:16
       <Col
         justify="center"
         align="center"
-        style={{ flex: "0 0 50px" }}
+        style={{}}
         onClick={handleClick}
       >
