[Killed] BlockStatement
components/Auth/Register/RegisterOptions.js:19:27
 
 class Register extends Component {
   // Handles google auth action and sends onboarding info to back end
-  handleGoogleAuth = e => {
-    e.preventDefault();
-    this.props.googleRegister(this.props.onboardingInfo);
-  };
+  handleGoogleAuth = e => {};
 
   // Handles facebook auth action and sends onboarding info to back end

[Killed] BlockStatement
components/Auth/Register/RegisterOptions.js:25:29
   };
 
   // Handles facebook auth action and sends onboarding info to back end
-  handleFacebookAuth = e => {
-    e.preventDefault();
-    this.props.facebookRegister(this.props.onboardingInfo);
-  };
+  handleFacebookAuth = e => {};
 
   render() {

[Killed] ConditionalExpression
components/Auth/Register/RegisterOptions.js:32:9
 
   render() {
     const { registerSuccess, path } = this.props;
-    if (registerSuccess) return <Redirect to="/" />;
+    if (false) return <Redirect to="/" />;
     return (
       <>

[Killed] ConditionalExpression
components/Auth/Register/RegisterOptions.js:32:9
 
   render() {
     const { registerSuccess, path } = this.props;
-    if (registerSuccess) return <Redirect to="/" />;
+    if (true) return <Redirect to="/" />;
     return (
       <>

[Killed] BlockStatement
components/Auth/Register/RegisterOptions.js:107:34
   /* color: black; */
 `;
 
-const mapStateToProps = state => {
-  return {
-    registerSuccess: !state.firebase.auth.isEmpty
-  };
-};
+const mapStateToProps = state => {};
 
 export { Register };

[Killed] ObjectLiteral
components/Auth/Register/RegisterOptions.js:108:10
 `;
 
 const mapStateToProps = state => {
-  return {
-    registerSuccess: !state.firebase.auth.isEmpty
-  };
+  return {};
 };
 

[Killed] BooleanLiteral
components/Auth/Register/RegisterOptions.js:109:22
 
 const mapStateToProps = state => {
   return {
-    registerSuccess: !state.firebase.auth.isEmpty
+    registerSuccess: state.firebase.auth.isEmpty
   };
 };

[Killed] ObjectLiteral
components/Auth/Register/RegisterOptions.js:114:41
 };
 
 export { Register };
-export default connect(mapStateToProps, {
-  googleRegister,
-  facebookRegister
-})(withRouter(Register));
+export default connect(mapStateToProps, {})(withRouter(Register));
 
