[Killed] StringLiteral
components/Auth/Register/RegisterWithEmail.js:12:15
 class RegisterWithEmail extends Component {
   state = {
     name: "",
-    password: "",
+    password: "Stryker was here!",
     email: ""
   };

[Killed] StringLiteral
components/Auth/Register/RegisterWithEmail.js:13:12
   state = {
     name: "",
     password: "",
-    email: ""
+    email: "Stryker was here!"
   };
 

[Killed] BlockStatement
components/Auth/Register/RegisterWithEmail.js:17:28
   };
 
   // Makes data fluid, like water. Data doesn't fill the input, it becomes the input
-  handleInputChange = e => {
-    this.setState({
-      ...this.state,
-      [e.target.name]: e.target.value
-    });
-  };
+  handleInputChange = e => {};
 
   // Handles email auth action and sends onboarding info to back end

[Killed] BlockStatement
components/Auth/Register/RegisterWithEmail.js:25:25
   };
 
   // Handles email auth action and sends onboarding info to back end
-  handleRegister = e => {
-    e.preventDefault();
-    this.props.register(
-      this.state.name,
-      this.state.email,
-      this.state.password,
-      this.props.onboardingInfo
-    );
-  };
+  handleRegister = e => {};
 
   render() {
