[Survived] StringLiteral
Global/icons/svg/CalendarSVG.js:6:10
 export default ({
   width = "28",
   height = "28",
-  fill = "#495057",
+  fill = "",
   margin = "0",
   padding = "3 0 0 3",

[Survived] StringLiteral
Global/icons/svg/CalendarSVG.js:7:12
   width = "28",
   height = "28",
   fill = "#495057",
-  margin = "0",
+  margin = "",
   padding = "3 0 0 3",
   viewBox = `0 0 25 25`

[Survived] StringLiteral
Global/icons/svg/CalendarSVG.js:9:13
   fill = "#495057",
   margin = "0",
   padding = "3 0 0 3",
-  viewBox = `0 0 25 25`
+  viewBox = ""
 }) => {
   return (

[Survived] StringLiteral
Global/icons/svg/CalendarSVG.js:16:24
       width={width}
       height={height}
       fill={fill}
-      style={{ margin: `${margin}`, padding: `${padding}` }}
+      style={{ margin: "", padding: `${padding}` }}
       viewBox={viewBox}
     >

[Survived] StringLiteral
Global/icons/svg/CalendarSVG.js:16:46
       width={width}
       height={height}
       fill={fill}
-      style={{ margin: `${margin}`, padding: `${padding}` }}
+      style={{ margin: `${margin}`, padding: "" }}
       viewBox={viewBox}
     >
