[Killed] ConditionalExpression
components/Auth/Register/index.js:23:9
     const { isLoggedIn, dob } = this.props;
 
     // If user is logged in on login page redirects them to protected route
-    if (isLoggedIn) return <Redirect to="/" id="homeRedirect"/>;
+    if (false) return <Redirect to="/" id="homeRedirect"/>;
 
     // If page refreshes we will lose onboarding data and back end won't be updated properly

[Killed] ConditionalExpression
components/Auth/Register/index.js:23:9
     const { isLoggedIn, dob } = this.props;
 
     // If user is logged in on login page redirects them to protected route
-    if (isLoggedIn) return <Redirect to="/" id="homeRedirect"/>;
+    if (true) return <Redirect to="/" id="homeRedirect"/>;
 
     // If page refreshes we will lose onboarding data and back end won't be updated properly

[Killed] ConditionalExpression
components/Auth/Register/index.js:28:9
     // If page refreshes we will lose onboarding data and back end won't be updated properly
     // If one piece of data is not filled out then it none of them are
     // In that even we will redirect them to the landing page to fill out the info again
-    if (!dob) return <Redirect to="/landing" id="landingRedirect" />;
+    if (true) return <Redirect to="/landing" id="landingRedirect" />;
 
     // Onboarding object we send to back end

[Killed] ConditionalExpression
components/Auth/Register/index.js:28:9
     // If page refreshes we will lose onboarding data and back end won't be updated properly
     // If one piece of data is not filled out then it none of them are
     // In that even we will redirect them to the landing page to fill out the info again
-    if (!dob) return <Redirect to="/landing" id="landingRedirect" />;
+    if (false) return <Redirect to="/landing" id="landingRedirect" />;
 
     // Onboarding object we send to back end

[Killed] BlockStatement
components/Auth/Register/index.js:74:41
   }
 }
 
-export const mapStateToProps = state => {
-  return {
-    // when user is not logged in isEmpty is true
-    isLoggedIn: !state.firebase.auth.isEmpty,
-
-    // Pulling in this state from onboarding reducer so we can create the onboarding object to pass to register actions
-    sex: state.onboarding.sex,
-    activity_level: state.onboarding.activityLevel,
-    dob: state.onboarding.date_of_birth,
-    weight_kg: state.onboarding.weight_kg,
-    height_cm: state.onboarding.height_cm,
-    weekly_goal_rate: state.onboarding.target_rate
-  };
-};
+export const mapStateToProps = state => {};
 
 export { Register };

[Killed] ObjectLiteral
components/Auth/Register/index.js:75:10
 }
 
 export const mapStateToProps = state => {
-  return {
-    // when user is not logged in isEmpty is true
-    isLoggedIn: !state.firebase.auth.isEmpty,
-
-    // Pulling in this state from onboarding reducer so we can create the onboarding object to pass to register actions
-    sex: state.onboarding.sex,
-    activity_level: state.onboarding.activityLevel,
-    dob: state.onboarding.date_of_birth,
-    weight_kg: state.onboarding.weight_kg,
-    height_cm: state.onboarding.height_cm,
-    weekly_goal_rate: state.onboarding.target_rate
-  };
+  return {};
 };
 

[Killed] BooleanLiteral
components/Auth/Register/index.js:77:17
 export const mapStateToProps = state => {
   return {
     // when user is not logged in isEmpty is true
-    isLoggedIn: !state.firebase.auth.isEmpty,
+    isLoggedIn: state.firebase.auth.isEmpty,
 
     // Pulling in this state from onboarding reducer so we can create the onboarding object to pass to register actions
