[Survived] StringLiteral
Global/icons/svg/DailyLogSVG.js:5:12
 
 export default ({
   width = '27',
-  height = '32',
+  height = "",
   fill = '000000',
   margin = '0',

[Survived] StringLiteral
Global/icons/svg/DailyLogSVG.js:7:12
   width = '27',
   height = '32',
   fill = '000000',
-  margin = '0',
+  margin = "",
   padding = '0 0 0 0',
   viewBox = '0 0 27 32'
