[Survived] BlockStatement
src/store/actions/axiosWithAuth.js:3:27
 import axios from "axios";
 
-export default function() {
-  const token = localStorage.getItem("token"); // Example of getting the token on every request
-
-  // Create an axios instance and set up the headers with the token
-  // to use on every single call.
-
-  // axiosWithAuth.post() example of how to use this helper
-  return axios.create({
-    headers: {
-      "Content-Type": "application/json",
-      Authorization: `Bearer ${token}` // Fat secret uses Bearer token
-    }
-  });
-}
+export default function() {}
 

[Survived] StringLiteral
src/store/actions/axiosWithAuth.js:4:38
 import axios from "axios";
 
 export default function() {
-  const token = localStorage.getItem("token"); // Example of getting the token on every request
+  const token = localStorage.getItem(""); // Example of getting the token on every request
 
   // Create an axios instance and set up the headers with the token

[Survived] ObjectLiteral
src/store/actions/axiosWithAuth.js:11:14
 
   // axiosWithAuth.post() example of how to use this helper
   return axios.create({
-    headers: {
-      "Content-Type": "application/json",
-      Authorization: `Bearer ${token}` // Fat secret uses Bearer token
-    }
+    headers: {}
   });
 }

[Survived] StringLiteral
src/store/actions/axiosWithAuth.js:13:22
   return axios.create({
     headers: {
       "Content-Type": "application/json",
-      Authorization: `Bearer ${token}` // Fat secret uses Bearer token
+      Authorization: "" // Fat secret uses Bearer token
     }
   });
