[Survived] StringLiteral
Global/icons/svg/GoogleSVG.js:5:12
 
 export default ({
   width = "35",
-  height = "35",
+  height = "",
   fill = "none",
   margin = "0",

[Survived] StringLiteral
Global/icons/svg/GoogleSVG.js:6:10
 export default ({
   width = "35",
   height = "35",
-  fill = "none",
+  fill = "",
   margin = "0",
   padding = "2 0 0 0",
