[Survived] BlockStatement
src/store/actions/firebaseAuth.js:7:55
 const googleProvider = new firebase.auth.GoogleAuthProvider();
 const facebookProvider = new firebase.auth.FacebookAuthProvider();
 
-export const login = (email, password) => dispatch => {
-  dispatch({ type: "LOGIN_START" });
-  firebase
-    .auth()
-    .signInWithEmailAndPassword(email, password)
-    .then(res => {
-      dispatch({ type: "LOGIN_SUCCESS" });
-      console.log("Login response:", res);
-    })
-    .catch(err => {
-      dispatch({ type: "LOGIN_ERROR", payload: err.message });
-      alert(err.message);
-    });
-};
+export const login = (email, password) => dispatch => {};
 
 // all register functions (email, google and facebook) take in an onboarding info object

[Survived] BlockStatement
src/store/actions/firebaseAuth.js:12:18
   firebase
     .auth()
     .signInWithEmailAndPassword(email, password)
-    .then(res => {
-      dispatch({ type: "LOGIN_SUCCESS" });
-      console.log("Login response:", res);
-    })
+    .then(res => {})
     .catch(err => {
       dispatch({ type: "LOGIN_ERROR", payload: err.message });

[Survived] StringLiteral
src/store/actions/firebaseAuth.js:13:24
     .auth()
     .signInWithEmailAndPassword(email, password)
     .then(res => {
-      dispatch({ type: "LOGIN_SUCCESS" });
+      dispatch({ type: "" });
       console.log("Login response:", res);
     })

[Survived] ObjectLiteral
src/store/actions/firebaseAuth.js:13:16
     .auth()
     .signInWithEmailAndPassword(email, password)
     .then(res => {
-      dispatch({ type: "LOGIN_SUCCESS" });
+      dispatch({});
       console.log("Login response:", res);
     })

[Survived] BlockStatement
src/store/actions/firebaseAuth.js:16:19
       dispatch({ type: "LOGIN_SUCCESS" });
       console.log("Login response:", res);
     })
-    .catch(err => {
-      dispatch({ type: "LOGIN_ERROR", payload: err.message });
-      alert(err.message);
-    });
+    .catch(err => {});
 };
 

[Survived] StringLiteral
src/store/actions/firebaseAuth.js:28:20
 // creating a new user object out of those two object and sending that new user object to the back end
 // to update back end with new user and onboarding info and back end sends everything to the right tables
 export const register = (name, email, password, onboardingInfo) => dispatch => {
-  dispatch({ type: "REGISTER_START" });
+  dispatch({ type: "" });
   firebase
     .auth()

[Survived] BlockStatement
src/store/actions/firebaseAuth.js:32:18
   firebase
     .auth()
     .createUserWithEmailAndPassword(email, password)
-    .then(res => {
-      const newUser = {
-        firebase_id: res.user.uid,
-        sex: onboardingInfo.sex,
-        activity_level: onboardingInfo.activity_level,
-        dob: onboardingInfo.dob,
-        weight_kg: onboardingInfo.weight_kg,
-        height_cm: onboardingInfo.height_cm,
-        weekly_goal_rate: onboardingInfo.weekly_goal_rate,
-        email: res.user.email
-      };
-      // a commit
-      console.log("New user info:", newUser);
-      axios
-        .post("https://nutri-journal.herokuapp.com/auth/register", newUser) // { headers: auth }
-        .then(response => console.log("Response:", response))
-        .catch(err => console.log("Error:", err));
-      return firebase.auth().currentUser.updateProfile({
-        displayName: name
-      });
-    })
+    .then(res => {})
     .then(() => {
       dispatch({ type: "REGISTER_SUCCESS" });

[Survived] StringLiteral
src/store/actions/firebaseAuth.js:46:15
       // a commit
       console.log("New user info:", newUser);
       axios
-        .post("https://nutri-journal.herokuapp.com/auth/register", newUser) // { headers: auth }
+        .post(""auth/register", newUser) // { headers: auth }
         .then(response => console.log("Response:", response))
         .catch(err => console.log("Error:", err));

[Survived] ObjectLiteral
src/store/actions/firebaseAuth.js:49:56
         .post("https://nutri-journal.herokuapp.com/auth/register", newUser) // { headers: auth }
         .then(response => console.log("Response:", response))
         .catch(err => console.log("Error:", err));
-      return firebase.auth().currentUser.updateProfile({
-        displayName: name
-      });
+      return firebase.auth().currentUser.updateProfile({});
     })
     .then(() => {

[Survived] BlockStatement
src/store/actions/firebaseAuth.js:53:17
         displayName: name
       });
     })
-    .then(() => {
-      dispatch({ type: "REGISTER_SUCCESS" });
-    })
+    .then(() => {})
     .catch(err => {
       dispatch({ type: "REGISTER_ERROR", payload: err.message });

[Survived] BlockStatement
src/store/actions/firebaseAuth.js:56:19
     .then(() => {
       dispatch({ type: "REGISTER_SUCCESS" });
     })
-    .catch(err => {
-      dispatch({ type: "REGISTER_ERROR", payload: err.message });
-      alert(err.message);
-    });
+    .catch(err => {});
 };
 

[Survived] ObjectLiteral
src/store/actions/firebaseAuth.js:57:16
       dispatch({ type: "REGISTER_SUCCESS" });
     })
     .catch(err => {
-      dispatch({ type: "REGISTER_ERROR", payload: err.message });
+      dispatch({});
       alert(err.message);
     });

[Survived] BlockStatement
src/store/actions/firebaseAuth.js:62:41
     });
 };
 
-export const logout = () => dispatch => {
-  dispatch({ type: "LOGOUT_START" });
-  firebase
-    .auth()
-    .signOut()
-    .then(() => {
-      dispatch({ type: "LOGOUT_SUCCESS" });
-    })
-    .catch(err => {
-      dispatch({ type: "LOGOUT_ERROR", payload: err.message });
-      alert(err.message);
-    });
-};
+export const logout = () => dispatch => {};
 
 export const googleLogin = () => dispatch => {

[Survived] BlockStatement
src/store/actions/firebaseAuth.js:67:17
   firebase
     .auth()
     .signOut()
-    .then(() => {
-      dispatch({ type: "LOGOUT_SUCCESS" });
-    })
+    .then(() => {})
     .catch(err => {
       dispatch({ type: "LOGOUT_ERROR", payload: err.message });

[Survived] BlockStatement
src/store/actions/firebaseAuth.js:70:19
     .then(() => {
       dispatch({ type: "LOGOUT_SUCCESS" });
     })
-    .catch(err => {
-      dispatch({ type: "LOGOUT_ERROR", payload: err.message });
-      alert(err.message);
-    });
+    .catch(err => {});
 };
 

[Survived] ObjectLiteral
src/store/actions/firebaseAuth.js:71:16
       dispatch({ type: "LOGOUT_SUCCESS" });
     })
     .catch(err => {
-      dispatch({ type: "LOGOUT_ERROR", payload: err.message });
+      dispatch({});
       alert(err.message);
     });

[Survived] StringLiteral
src/store/actions/firebaseAuth.js:77:20
 };
 
 export const googleLogin = () => dispatch => {
-  dispatch({ type: "GOOGLE_LOGIN_START" });
+  dispatch({ type: "" });
   firebase
     .auth()

[Survived] BlockStatement
src/store/actions/firebaseAuth.js:81:18
   firebase
     .auth()
     .signInWithPopup(googleProvider)
-    .then(res => {
-      // google login response
-      console.log("Google response:", res);
-
-      // This gives you a Google Access Token. You can use it to access the Google API.
-      const token = res.credential.accessToken;
-
-      console.log("Token:", token);
-
-      // The signed-in user info.
-      const user = res.user.displayName;
-      const userPicture = res.additionalUserInfo.profile.picture;
-
-      console.log("User:", user);
-      console.log("Picture:", userPicture);
-
-      // ...
-      dispatch({ type: "GOOGLE_LOGIN_SUCCESS", payload: token });
-    })
+    .then(res => {})
     .catch(function(error) {
       // Handle Errors here.

[Survived] StringLiteral
src/store/actions/firebaseAuth.js:83:19
     .signInWithPopup(googleProvider)
     .then(res => {
       // google login response
-      console.log("Google response:", res);
+      console.log("", res);
 
       // This gives you a Google Access Token. You can use it to access the Google API.

[Survived] StringLiteral
src/store/actions/firebaseAuth.js:94:19
       const user = res.user.displayName;
       const userPicture = res.additionalUserInfo.profile.picture;
 
-      console.log("User:", user);
+      console.log("", user);
       console.log("Picture:", userPicture);
 

[Survived] StringLiteral
src/store/actions/firebaseAuth.js:95:19
       const userPicture = res.additionalUserInfo.profile.picture;
 
       console.log("User:", user);
-      console.log("Picture:", userPicture);
+      console.log("", userPicture);
 
       // ...

[Survived] BlockStatement
src/store/actions/firebaseAuth.js:100:28
       // ...
       dispatch({ type: "GOOGLE_LOGIN_SUCCESS", payload: token });
     })
-    .catch(function(error) {
-      // Handle Errors here.
-      const errorCode = error.code;
-      console.log("Error code:", errorCode);
-
-      const errorMessage = error.message;
-      console.log("Error message:", errorMessage);
-
-      // The email of the user's account used.
-      const email = error.email;
-      console.log("email:", email);
-
-      // The firebase.auth.AuthCredential type that was used.
-      const credential = error.credential;
-      console.log("Credential:", credential);
-
-      // ...
-      dispatch({ type: "GOOGLE_LOGIN_FAILURE" });
-    });
+    .catch(function(error) {});
 };
 

[Survived] StringLiteral
src/store/actions/firebaseAuth.js:110:19
 
       // The email of the user's account used.
       const email = error.email;
-      console.log("email:", email);
+      console.log("", email);
 
       // The firebase.auth.AuthCredential type that was used.

[Survived] StringLiteral
src/store/actions/firebaseAuth.js:114:19
 
       // The firebase.auth.AuthCredential type that was used.
       const credential = error.credential;
-      console.log("Credential:", credential);
+      console.log("", credential);
 
       // ...

[Survived] StringLiteral
src/store/actions/firebaseAuth.js:117:24
       console.log("Credential:", credential);
 
       // ...
-      dispatch({ type: "GOOGLE_LOGIN_FAILURE" });
+      dispatch({ type: "" });
     });
 };

[Survived] ObjectLiteral
src/store/actions/firebaseAuth.js:117:16
       console.log("Credential:", credential);
 
       // ...
-      dispatch({ type: "GOOGLE_LOGIN_FAILURE" });
+      dispatch({});
     });
 };

[Survived] StringLiteral
src/store/actions/firebaseAuth.js:155:24
       console.log("User:", user);
       console.log("Picture:", userPicture);
       // ...
-      dispatch({ type: "GOOGLE_REGISTER_SUCCESS" });
+      dispatch({ type: "" });
     })
     .catch(function(error) {

[Survived] ObjectLiteral
src/store/actions/firebaseAuth.js:155:16
       console.log("User:", user);
       console.log("Picture:", userPicture);
       // ...
-      dispatch({ type: "GOOGLE_REGISTER_SUCCESS" });
+      dispatch({});
     })
     .catch(function(error) {

[Survived] BlockStatement
src/store/actions/firebaseAuth.js:157:28
       // ...
       dispatch({ type: "GOOGLE_REGISTER_SUCCESS" });
     })
-    .catch(function(error) {
-      // Handle Errors here.
-      const errorCode = error.code;
-      console.log("Error code:", errorCode);
-      const errorMessage = error.message;
-      console.log("Error message:", errorMessage);
-      // The email of the user's account used.
-      const email = error.email;
-      console.log("email:", email);
-      // The firebase.auth.AuthCredential type that was used.
-      const credential = error.credential;
-      console.log("Credential:", credential);
-      // ...
-      dispatch({ type: "GOOGLE_REGISTER_FAILURE" });
-    });
+    .catch(function(error) {});
 };
 

[Survived] StringLiteral
src/store/actions/firebaseAuth.js:160:19
     .catch(function(error) {
       // Handle Errors here.
       const errorCode = error.code;
-      console.log("Error code:", errorCode);
+      console.log("", errorCode);
       const errorMessage = error.message;
       console.log("Error message:", errorMessage);

[Survived] BlockStatement
src/store/actions/firebaseAuth.js:179:18
   firebase
     .auth()
     .signInWithPopup(facebookProvider)
-    .then(res => {
-      // facebook login response
-      console.log("Facebook response:", res);
-      // This gives you a Google Access Token. You can use it to access the Google API.
-      const token = res.credential.accessToken;
-      console.log("Token:", token);
-      // The signed-in user info.
-      const user = res.user;
-      console.log("User:", user);
-      // ...
-      dispatch({ type: "FACEBOOK_LOGIN_SUCCESS" });
-    })
+    .then(res => {})
     .catch(function(error) {
       // Handle Errors here.

[Survived] StringLiteral
src/store/actions/firebaseAuth.js:184:19
       console.log("Facebook response:", res);
       // This gives you a Google Access Token. You can use it to access the Google API.
       const token = res.credential.accessToken;
-      console.log("Token:", token);
+      console.log("", token);
       // The signed-in user info.
       const user = res.user;

[Survived] ObjectLiteral
src/store/actions/firebaseAuth.js:189:16
       const user = res.user;
       console.log("User:", user);
       // ...
-      dispatch({ type: "FACEBOOK_LOGIN_SUCCESS" });
+      dispatch({});
     })
     .catch(function(error) {

[Survived] StringLiteral
src/store/actions/firebaseAuth.js:189:24
       const user = res.user;
       console.log("User:", user);
       // ...
-      dispatch({ type: "FACEBOOK_LOGIN_SUCCESS" });
+      dispatch({ type: "" });
     })
     .catch(function(error) {

[Survived] BlockStatement
src/store/actions/firebaseAuth.js:191:28
       // ...
       dispatch({ type: "FACEBOOK_LOGIN_SUCCESS" });
     })
-    .catch(function(error) {
-      // Handle Errors here.
-      const errorCode = error.code;
-      console.log("Error code:", errorCode);
-      const errorMessage = error.message;
-      console.log("Error message:", errorMessage);
-      // The email of the user's account used.
-      const email = error.email;
-      console.log("email:", email);
-      // The firebase.auth.AuthCredential type that was used.
-      const credential = error.credential;
-      console.log("Credential:", credential);
-      // ...
-      dispatch({ type: "FACEBOOK_LOGIN_FAILURE" });
-    });
+    .catch(function(error) {});
 };
 

[Survived] StringLiteral
src/store/actions/firebaseAuth.js:196:19
       const errorCode = error.code;
       console.log("Error code:", errorCode);
       const errorMessage = error.message;
-      console.log("Error message:", errorMessage);
+      console.log("", errorMessage);
       // The email of the user's account used.
       const email = error.email;

[Survived] ObjectLiteral
src/store/actions/firebaseAuth.js:204:16
       const credential = error.credential;
       console.log("Credential:", credential);
       // ...
-      dispatch({ type: "FACEBOOK_LOGIN_FAILURE" });
+      dispatch({});
     });
 };

[Survived] StringLiteral
src/store/actions/firebaseAuth.js:215:19
     .signInWithPopup(facebookProvider)
     .then(res => {
       // facebook login response
-      console.log("Facebook response:", res);
+      console.log("", res);
       // This gives you a Google Access Token. You can use it to access the Google API.
       const token = res.credential.accessToken;

[Survived] StringLiteral
src/store/actions/firebaseAuth.js:235:35
       axios
         .post("https://nutri-journal.herokuapp.com/auth/register", newUser) // { headers: auth }
         .then(response => console.log("Response:", response))
-        .catch(err => console.log("Error:", err));
+        .catch(err => console.log("", err));
 
       // The signed-in user info.
