[Survived] ConditionalExpression
src/store/reducers/firebaseAuth.js:6:5
 export const firebaseAuth = (state = initialState, action) => {
   switch (action.type) {
     // login reducer
-    case "LOGIN_START":
-      return {
-        ...state,
-        loggingIn: true,
-        isLoggedIn: false,
-        error: null
-      };
+    // login reducer
+case "LOGIN_START":
     case "LOGIN_SUCCESS":
       return {

[Survived] StringLiteral
src/store/reducers/firebaseAuth.js:6:10
 export const firebaseAuth = (state = initialState, action) => {
   switch (action.type) {
     // login reducer
-    case "LOGIN_START":
+    case "":
       return {
         ...state,

[Survived] BooleanLiteral
src/store/reducers/firebaseAuth.js:9:20
     case "LOGIN_START":
       return {
         ...state,
-        loggingIn: true,
+        loggingIn: false,
         isLoggedIn: false,
         error: null

[Survived] BooleanLiteral
src/store/reducers/firebaseAuth.js:10:21
       return {
         ...state,
         loggingIn: true,
-        isLoggedIn: false,
+        isLoggedIn: true,
         error: null
       };

[Survived] ConditionalExpression
src/store/reducers/firebaseAuth.js:13:5
         isLoggedIn: false,
         error: null
       };
-    case "LOGIN_SUCCESS":
-      return {
-        ...state,
-        loggingIn: false,
-        isLoggedIn: true,
-        error: null
-      };
+    case "LOGIN_SUCCESS":
     case "LOGIN_FAILURE":
       return {

[Survived] StringLiteral
src/store/reducers/firebaseAuth.js:13:10
         isLoggedIn: false,
         error: null
       };
-    case "LOGIN_SUCCESS":
+    case "":
       return {
         ...state,

[Survived] BooleanLiteral
src/store/reducers/firebaseAuth.js:16:20
     case "LOGIN_SUCCESS":
       return {
         ...state,
-        loggingIn: false,
+        loggingIn: true,
         isLoggedIn: true,
         error: null

[Survived] BooleanLiteral
src/store/reducers/firebaseAuth.js:17:21
       return {
         ...state,
         loggingIn: false,
-        isLoggedIn: true,
+        isLoggedIn: false,
         error: null
       };

[Survived] ConditionalExpression
src/store/reducers/firebaseAuth.js:20:5
         isLoggedIn: true,
         error: null
       };
-    case "LOGIN_FAILURE":
-      return {
-        ...state,
-        loggingIn: false,
-        isLoggedIn: false
-      };
+    case "LOGIN_FAILURE": // register reducer
 
     // register reducer

[Survived] BooleanLiteral
src/store/reducers/firebaseAuth.js:24:21
       return {
         ...state,
         loggingIn: false,
-        isLoggedIn: false
+        isLoggedIn: true
       };
 

[Survived] ConditionalExpression
src/store/reducers/firebaseAuth.js:28:5
       };
 
     // register reducer
-    case "REGISTER_START":
-      return {
-        ...state,
-        loggingIn: true,
-        isLoggedIn: false,
-        error: ""
-      };
+    // register reducer
+case "REGISTER_START":
 
     case "REGISTER_SUCCESS":

[Survived] StringLiteral
src/store/reducers/firebaseAuth.js:28:10
       };
 
     // register reducer
-    case "REGISTER_START":
+    case "":
       return {
         ...state,

[Survived] ObjectLiteral
src/store/reducers/firebaseAuth.js:29:14
 
     // register reducer
     case "REGISTER_START":
-      return {
-        ...state,
-        loggingIn: true,
-        isLoggedIn: false,
-        error: ""
-      };
+      return {};
 
     case "REGISTER_SUCCESS":

[Survived] ConditionalExpression
src/store/reducers/firebaseAuth.js:36:5
         error: ""
       };
 
-    case "REGISTER_SUCCESS":
-      return {
-        ...state,
-        loggingIn: false,
-        isLoggedIn: true,
-        error: ""
-      };
+    case "REGISTER_SUCCESS":
 
     case "REGISTER_FAILURE":

[Survived] StringLiteral
src/store/reducers/firebaseAuth.js:41:16
         ...state,
         loggingIn: false,
         isLoggedIn: true,
-        error: ""
+        error: "Stryker was here!"
       };
 

[Survived] ConditionalExpression
src/store/reducers/firebaseAuth.js:44:5
         error: ""
       };
 
-    case "REGISTER_FAILURE":
-      return {
-        ...state,
-        isLoggedIn: false,
-        error: action.payload
-      };
+    case "REGISTER_FAILURE": // logout reducer
 
     // logout reducer

[Survived] BooleanLiteral
src/store/reducers/firebaseAuth.js:47:21
     case "REGISTER_FAILURE":
       return {
         ...state,
-        isLoggedIn: false,
+        isLoggedIn: true,
         error: action.payload
       };

[Survived] ConditionalExpression
src/store/reducers/firebaseAuth.js:52:5
       };
 
     // logout reducer
-    case "LOGOUT_START":
-      return {
-        ...state,
-        loggedOut: false
-      };
+    // logout reducer
+case "LOGOUT_START":
 
     case "LOGOUT_SUCCESS":

[Survived] BooleanLiteral
src/store/reducers/firebaseAuth.js:55:20
     case "LOGOUT_START":
       return {
         ...state,
-        loggedOut: false
+        loggedOut: true
       };
 

[Survived] ConditionalExpression
src/store/reducers/firebaseAuth.js:58:5
         loggedOut: false
       };
 
-    case "LOGOUT_SUCCESS":
-      return {
-        ...state,
-        loggedOut: true,
-        token: null
-      };
+    case "LOGOUT_SUCCESS":
 
     case "LOGOUT_FAILURE":

[Survived] StringLiteral
src/store/reducers/firebaseAuth.js:58:10
         loggedOut: false
       };
 
-    case "LOGOUT_SUCCESS":
+    case "":
       return {
         ...state,

[Survived] BooleanLiteral
src/store/reducers/firebaseAuth.js:61:20
     case "LOGOUT_SUCCESS":
       return {
         ...state,
-        loggedOut: true,
+        loggedOut: false,
         token: null
       };

[Survived] ConditionalExpression
src/store/reducers/firebaseAuth.js:65:5
         token: null
       };
 
-    case "LOGOUT_FAILURE":
-      return {
-        ...state,
-        loggedOut: false
-      };
+    case "LOGOUT_FAILURE": // google login reducer
 
     // google login reducer

[Survived] ConditionalExpression
src/store/reducers/firebaseAuth.js:72:5
       };
 
     // google login reducer
-    case "GOOGLE_LOGIN_START":
-      return {
-        ...state,
-        loggingIn: true,
-        isLoggedIn: false,
-        error: null
-      };
+    // google login reducer
+case "GOOGLE_LOGIN_START":
     case "GOOGLE_LOGIN_SUCCESS":
       return {

[Survived] StringLiteral
src/store/reducers/firebaseAuth.js:72:10
       };
 
     // google login reducer
-    case "GOOGLE_LOGIN_START":
+    case "":
       return {
         ...state,

[Survived] ConditionalExpression
src/store/reducers/firebaseAuth.js:79:5
         isLoggedIn: false,
         error: null
       };
-    case "GOOGLE_LOGIN_SUCCESS":
-      return {
-        ...state,
-        loggingIn: false,
-        isLoggedIn: true,
-        token: action.payload,
-        error: null
-      };
+    case "GOOGLE_LOGIN_SUCCESS":
     case "GOOGLE_LOGIN_FAILURE":
       return {

[Survived] StringLiteral
src/store/reducers/firebaseAuth.js:79:10
         isLoggedIn: false,
         error: null
       };
-    case "GOOGLE_LOGIN_SUCCESS":
+    case "":
       return {
         ...state,

[Survived] ConditionalExpression
src/store/reducers/firebaseAuth.js:87:5
         token: action.payload,
         error: null
       };
-    case "GOOGLE_LOGIN_FAILURE":
-      return {
-        ...state,
-        loggingIn: false,
-        isLoggedIn: false
-      };
+    case "GOOGLE_LOGIN_FAILURE": // facebook login reducer
 
     // facebook login reducer

[Survived] ConditionalExpression
src/store/reducers/firebaseAuth.js:95:5
       };
 
     // facebook login reducer
-    case "FACEBOOK_LOGIN_START":
-      return {
-        ...state,
-        loggingIn: true,
-        isLoggedIn: false,
-        error: null
-      };
+    // facebook login reducer
+case "FACEBOOK_LOGIN_START":
     case "FACEBOOK_LOGIN_SUCCESS":
       return {

[Survived] ObjectLiteral
src/store/reducers/firebaseAuth.js:96:14
 
     // facebook login reducer
     case "FACEBOOK_LOGIN_START":
-      return {
-        ...state,
-        loggingIn: true,
-        isLoggedIn: false,
-        error: null
-      };
+      return {};
     case "FACEBOOK_LOGIN_SUCCESS":
       return {

[Survived] ConditionalExpression
src/store/reducers/firebaseAuth.js:102:5
         isLoggedIn: false,
         error: null
       };
-    case "FACEBOOK_LOGIN_SUCCESS":
-      return {
-        ...state,
-        loggingIn: false,
-        isLoggedIn: true,
-        error: null
-      };
+    case "FACEBOOK_LOGIN_SUCCESS":
     case "FACEBOOK_LOGIN_FAILURE":
       return {

[Survived] ObjectLiteral
src/store/reducers/firebaseAuth.js:103:14
         error: null
       };
     case "FACEBOOK_LOGIN_SUCCESS":
-      return {
-        ...state,
-        loggingIn: false,
-        isLoggedIn: true,
-        error: null
-      };
+      return {};
     case "FACEBOOK_LOGIN_FAILURE":
       return {

[Survived] ConditionalExpression
src/store/reducers/firebaseAuth.js:109:5
         isLoggedIn: true,
         error: null
       };
-    case "FACEBOOK_LOGIN_FAILURE":
-      return {
-        ...state,
-        loggingIn: false,
-        isLoggedIn: false
-      };
+    case "FACEBOOK_LOGIN_FAILURE": // return default state in case the case doesn't match any of our cases
 
     // return default state in case the case doesn't match any of our cases

[Survived] ConditionalExpression
src/store/reducers/firebaseAuth.js:117:5
       };
 
     // return default state in case the case doesn't match any of our cases
-    default:
-      return state;
+    // return default state in case the case doesn't match any of our cases
+default:
   }
 };
