[Survived] StringLiteral
Global/icons/svg/ProgressSVG.js:4:11
 import React from 'react';
 
 export default ({
-  width = '37',
+  width = "",
   height = '29',
   fill = '000000',

[Survived] StringLiteral
Global/icons/svg/ProgressSVG.js:9:13
   fill = '000000',
   margin = '0',
   padding = '0 0 0 0',
-  viewBox = '0 0 27 32'
+  viewBox = ""
 }) => {
   return (
