[Survived] BlockStatement
src/store/actions/firebaseAuth.js:32:18
   firebase
     .auth()
     .createUserWithEmailAndPassword(email, password)
-    .then(res => {
-      const newUser = {
-        firebase_id: res.user.uid,
-        sex: onboardingInfo.sex,
-        activity_level: onboardingInfo.activity_level,
-        dob: onboardingInfo.dob,
-        weight_kg: onboardingInfo.weight_kg,
-        height_cm: onboardingInfo.height_cm,
-        weekly_goal_rate: onboardingInfo.weekly_goal_rate,
-        email: res.user.email
-      };
-      // a commit
-      console.log("New user info:", newUser);
-      axios
-        .post("https://nutri-journal.herokuapp.com//auth/register", newUser) // { headers: auth }
-        .then(response => console.log("Response:", response))
-        .catch(err => console.log("Error:", err));
-      return firebase.auth().currentUser.updateProfile({
-        displayName: name
-      });
-    })
+    .then(res => {})
     .then(() => {
       dispatch({ type: "REGISTER_SUCCESS" });

[Survived] StringLiteral
src/store/actions/firebaseAuth.js:46:15
       // a commit
       console.log("New user info:", newUser);
       axios
-        .post("https://nutri-journal.herokuapp.com//auth/register", newUser) // { headers: auth }
+        .post(""/auth/register", newUser) // { headers: auth }
         .then(response => console.log("Response:", response))
         .catch(err => console.log("Error:", err));
