[Survived] StringLiteral
Global/icons/svg/RecipeSVG.js:8:13
   height = '30',
   fill = '000000',
   margin = '0 0 0 0',
-  padding = '0 0 0 0',
+  padding = "",
   viewBox = '0 0 28 30'
 }) => {

[Survived] StringLiteral
Global/icons/svg/RecipeSVG.js:9:13
   fill = '000000',
   margin = '0 0 0 0',
   padding = '0 0 0 0',
-  viewBox = '0 0 28 30'
+  viewBox = ""
 }) => {
   return (
