[Survived] StringLiteral
Global/styled/components/Col.js:24:5
   direction: PropTypes.oneOf([
     "row",
     "row-reverse",
-    "column",
+    "",
     "column-reverse"
   ]),

[Survived] StringLiteral
Global/styled/components/Col.js:25:5
     "row",
     "row-reverse",
     "column",
-    "column-reverse"
+    ""
   ]),
 

[Survived] StringLiteral
Global/styled/components/Col.js:30:5
 
   justify: PropTypes.oneOf([
     "flex-start",
-    "flex-end",
+    "",
     "center",
     "space-between",

[Survived] StringLiteral
Global/styled/components/Col.js:31:5
   justify: PropTypes.oneOf([
     "flex-start",
     "flex-end",
-    "center",
+    "",
     "space-between",
     "space-around",

[Survived] StringLiteral
Global/styled/components/Col.js:32:5
     "flex-start",
     "flex-end",
     "center",
-    "space-between",
+    "",
     "space-around",
     "space-evenly"

[Survived] StringLiteral
Global/styled/components/Col.js:34:5
     "center",
     "space-between",
     "space-around",
-    "space-evenly"
+    ""
   ]),
   align: PropTypes.oneOf([

[Survived] ArrayDeclaration
Global/styled/components/Col.js:36:26
     "space-around",
     "space-evenly"
   ]),
-  align: PropTypes.oneOf([
-    "stretch",
-    "flex-start",
-    "flex-end",
-    "center",
-    "baseline"
-  ]),
+  align: PropTypes.oneOf([]),
   height: PropTypes.string
 

[Survived] StringLiteral
Global/styled/components/Col.js:41:5
     "flex-start",
     "flex-end",
     "center",
-    "baseline"
+    ""
   ]),
   height: PropTypes.string
