[Survived] StringLiteral
Global/styled/components/Container.js:9:64
 const StyledContainer = styled(Container)`
   display: flex;
   flex-direction: column;
-  justify-content: ${props => (props.justify ? props.justify : "flex-start")};
+  justify-content: ${props => (props.justify ? props.justify : "")};
   align-items: ${props => (props.align ? props.align : "stretch")};
 

[Survived] StringLiteral
Global/styled/components/Container.js:10:56
   display: flex;
   flex-direction: column;
   justify-content: ${props => (props.justify ? props.justify : "flex-start")};
-  align-items: ${props => (props.align ? props.align : "stretch")};
+  align-items: ${props => (props.align ? props.align : "")};
 
   height: ${props => props.height ? props.height : "calc(100vh - (100px))"};

[Survived] StringLiteral
Global/styled/components/Container.js:12:52
   justify-content: ${props => (props.justify ? props.justify : "flex-start")};
   align-items: ${props => (props.align ? props.align : "stretch")};
 
-  height: ${props => props.height ? props.height : "calc(100vh - (100px))"};
+  height: ${props => props.height ? props.height : ""};
 
   /* border: 1px solid red; */

[Survived] ArrayDeclaration
Global/styled/components/Container.js:21:28
 
 StyledContainer.propTypes = {
   // CUSTOM PROPTYPES
-  justify: PropTypes.oneOf([
-    "flex-start",
-    "flex-end",
-    "center",
-    "space-between",
-    "space-around",
-    "space-evenly"
-  ]),
+  justify: PropTypes.oneOf([]),
   align: PropTypes.oneOf([
     "stretch",
