[Survived] StringLiteral
Global/styled/components/Input.js:7:53
 
 export const StyledInput = styled(Input)`
   font-size: 1.6rem;
-  height: ${props => (props.height ? props.height : "38px")};
+  height: ${props => (props.height ? props.height : "")};
 `;
 

[Survived] ObjectLiteral
Global/styled/components/Input.js:12:25
 
 export default StyledInput;
 
-StyledInput.propTypes = {
-  height: PropTypes.string
-};
+StyledInput.propTypes = {};
 
 /*
