[Survived] StringLiteral
Global/styled/components/Row.js:8:53
 
 const StyledRow = styled(Row)`
   align-items: ${props => (props.align ? props.align : "stretch")};
-  height: ${props => (props.height ? props.height : "auto")};
+  height: ${props => (props.height ? props.height : "")};
 
   /* border: 1px solid blue; */

[Survived] StringLiteral
Global/styled/components/Row.js:18:5
 StyledRow.propTypes = {
   // CUSTOM PROPTYPES
   align: PropTypes.oneOf([
-    "stretch",
+    "",
     "flex-start",
     "flex-end",
