[Survived] StringLiteral
components/Global/theme/index.js:4:14
 const theme = {
   color: {
     // basic bootstrap colors
-    primary: "#217aff",
+    primary: "",
     secondary: "#6c757c",
     success: "#34a745",

[Survived] StringLiteral
components/Global/theme/index.js:8:14
     secondary: "#6c757c",
     success: "#34a745",
     danger: "#dc3545",
-    warning: "#fbc10a",
+    warning: "",
     info: "#31a2b8",
     light: "#f8f9fa",

[Survived] StringLiteral
components/Global/theme/index.js:9:11
     success: "#34a745",
     danger: "#dc3545",
     warning: "#fbc10a",
-    info: "#31a2b8",
+    info: "",
     light: "#f8f9fa",
     dark: "#343a40",

[Survived] StringLiteral
components/Global/theme/index.js:10:12
     danger: "#dc3545",
     warning: "#fbc10a",
     info: "#31a2b8",
-    light: "#f8f9fa",
+    light: "",
     dark: "#343a40",
     white: "#ffffff"

[Survived] StringLiteral
components/Global/theme/index.js:11:11
     warning: "#fbc10a",
     info: "#31a2b8",
     light: "#f8f9fa",
-    dark: "#343a40",
+    dark: "",
     white: "#ffffff"
   },

[Survived] StringLiteral
components/Global/theme/index.js:17:49
   mixin: {
     flex: (direction, justify, align) =>
       `display: flex;
-      flex-direction: ${direction ? direction : "row"};
+      flex-direction: ${direction ? direction : ""};
       justify-content: ${justify ? justify : "flex-start"};
       align-items: ${align ? align : "stretch"}`

[Survived] StringLiteral
components/Global/theme/index.js:18:46
     flex: (direction, justify, align) =>
       `display: flex;
       flex-direction: ${direction ? direction : "row"};
-      justify-content: ${justify ? justify : "flex-start"};
+      justify-content: ${justify ? justify : ""};
       align-items: ${align ? align : "stretch"}`
   }
