[Survived] BlockStatement
src/components/LandingPage/index.js:11:32
 import { Redirect, withRouter } from "react-router-dom";
 
 class LandingPage extends React.Component {
-  redirectToOnboarding = () => {
-    this.props.history.push("/onboarding/sex");
-  };
+  redirectToOnboarding = () => {};
 
   redirectToLogin = () => {

[Survived] StringLiteral
src/components/LandingPage/index.js:12:29
 
 class LandingPage extends React.Component {
   redirectToOnboarding = () => {
-    this.props.history.push("/onboarding/sex");
+    this.props.history.push("");
   };
 

[Survived] BlockStatement
src/components/LandingPage/index.js:15:27
     this.props.history.push("/onboarding/sex");
   };
 
-  redirectToLogin = () => {
-    this.props.history.push("/login");
-  };
+  redirectToLogin = () => {};
 
   render() {

[Survived] StringLiteral
src/components/LandingPage/index.js:16:29
   };
 
   redirectToLogin = () => {
-    this.props.history.push("/login");
+    this.props.history.push("");
   };
 

[Survived] ConditionalExpression
src/components/LandingPage/index.js:22:9
   render() {
     // once user logs in isLoggedIn will be true and route you to home page
     const { isLoggedIn } = this.props;
-    if (isLoggedIn) return <Redirect to="/" />;
+    if (true) return <Redirect to="/" />;
 
     return (

[Survived] ConditionalExpression
src/components/LandingPage/index.js:22:9
   render() {
     // once user logs in isLoggedIn will be true and route you to home page
     const { isLoggedIn } = this.props;
-    if (isLoggedIn) return <Redirect to="/" />;
+    if (false) return <Redirect to="/" />;
 
     return (

[Survived] BlockStatement
src/components/LandingPage/index.js:55:34
   }
 }
 
-const mapStateToProps = state => {
-  return {
-    // when user is not logged in isEmpty is true
-    isLoggedIn: !state.firebase.auth.isEmpty
-  };
-};
+const mapStateToProps = state => {};
 
 export default connect(mapStateToProps, {})(withRouter(LandingPage));

[Survived] BooleanLiteral
src/components/LandingPage/index.js:58:17
 const mapStateToProps = state => {
   return {
     // when user is not logged in isEmpty is true
-    isLoggedIn: !state.firebase.auth.isEmpty
+    isLoggedIn: state.firebase.auth.isEmpty
   };
 };
