[Survived] BlockStatement
components/Navigation/components/BottomNav.js:11:36
 import { DailyLogSVG, RecipeSVG, ProgressSVG, SettingsSVG } from '../../Global/icons';
 import theme from '../../Global/theme';
 
-const BottomNav = ({ display }) => {
-  return (
-    <NavContainer display={display}>
-      <NavBar>
-        <NavItem>
-          <NavLink href="/daily-log"><DailyLogSVG /></NavLink>
-        </NavItem>
-        <NavItem>
-          <NavLink href="/recipes"><RecipeSVG /></NavLink>
-        </NavItem>
-        <NavItem>
-          <NavLink href="/reports"><ProgressSVG /></NavLink>
-        </NavItem>
-        <NavItem>
-          <NavLink href="/settings"><SettingsSVG /></NavLink>
-        </NavItem>
-      </NavBar>
-    </NavContainer>
-  )
-}
+const BottomNav = ({ display }) => {}
 const NavContainer = styled.div`
   display: ${props => props.display ? "block" : "none"};

[Survived] StringLiteral
components/Navigation/components/BottomNav.js:31:32
     </NavContainer>
   )
 }
-const NavContainer = styled.div`
-  display: ${props => props.display ? "block" : "none"};
-`;
+const NavContainer = styled.div"";
 const NavBar = styled(BS_NavBar)`
   ${theme.mixin.flex("row", "space-between", "center")};

[Survived] StringLiteral
components/Navigation/components/BottomNav.js:35:29
   display: ${props => props.display ? "block" : "none"};
 `;
 const NavBar = styled(BS_NavBar)`
-  ${theme.mixin.flex("row", "space-between", "center")};
+  ${theme.mixin.flex("row", "", "center")};
 ​
   height: 50px;

[Survived] StringLiteral
components/Navigation/components/BottomNav.js:42:35
 ​
   background-color: black;
 `;
-const NavItem = styled(BS_NavItem)`
-  ${theme.mixin.flex("row", "center", "center")};
-​
-  width: 25%;
-  height: 100%;
-`;
+const NavItem = styled(BS_NavItem)"";
 
 export default BottomNav;

[Survived] StringLiteral
components/Navigation/components/BottomNav.js:43:22
   background-color: black;
 `;
 const NavItem = styled(BS_NavItem)`
-  ${theme.mixin.flex("row", "center", "center")};
+  ${theme.mixin.flex("", "center", "center")};
 ​
   width: 25%;
