[Survived] BlockStatement
components/Navigation/components/TopNav.js:12:25
 import { BackSVG } from "../../Global/icons";
 import theme from "../../Global/theme";
 
-const TopNav = props => {
-  const {
-    pageTitle,
-    titleColor,
-    topNavColor,
-    buttonColor,
-    iconColor,
-    display,
-    history
-  } = props;
-
-  return (
-    <NavContainer display={display}>
-      <Navbar topNavColor={topNavColor}>
-        <Button buttonColor={buttonColor} onClick={() => history.goBack()}>
-          <BackSVG fill={iconColor} />
-        </Button>
-        <NavbarBrand titleColor={titleColor}>
-          {pageTitle}
-        </NavbarBrand>
-      </Navbar>
-    </NavContainer>
-  );
-};
+const TopNav = props => {};
 
 const NavContainer = styled.div`

[Survived] StringLiteral
components/Navigation/components/TopNav.js:38:50
 };
 
 const NavContainer = styled.div`
-  display: ${props => (props.display ? "block" : "none")};
+  display: ${props => (props.display ? "block" : "")};
 `;
 

[Survived] StringLiteral
components/Navigation/components/TopNav.js:38:40
 };
 
 const NavContainer = styled.div`
-  display: ${props => (props.display ? "block" : "none")};
+  display: ${props => (props.display ? "" : "none")};
 `;
 

[Survived] StringLiteral
components/Navigation/components/TopNav.js:41:33
   display: ${props => (props.display ? "block" : "none")};
 `;
 
-const Navbar = styled(BS_NavBar)`
-  ${theme.mixin.flex("row", "flex-start", "center")};
-
-  height: 50px;
-  padding: 0 3px;
-
-  background-color: ${props => props.topNavColor};
-`;
+const Navbar = styled(BS_NavBar)"";
 
 const Button = styled(BS_Button)`

[Survived] StringLiteral
components/Navigation/components/TopNav.js:42:29
 `;
 
 const Navbar = styled(BS_NavBar)`
-  ${theme.mixin.flex("row", "flex-start", "center")};
+  ${theme.mixin.flex("row", "", "center")};
 
   height: 50px;
