[Survived] StringLiteral
src/components/Navigation/withNavigation.js:9:16
 // both the top and bottom nav
 const withNavigation = ({
   pageTitle = "",
-  titleColor = "white",
+  titleColor = "",
   iconColor = "white",
   topNavColor = "black",

[Survived] StringLiteral
src/components/Navigation/withNavigation.js:11:17
   pageTitle = "",
   titleColor = "white",
   iconColor = "white",
-  topNavColor = "black",
+  topNavColor = "",
   displayTop = true,
   displayBottom = true

[Survived] BooleanLiteral
src/components/Navigation/withNavigation.js:12:16
   titleColor = "white",
   iconColor = "white",
   topNavColor = "black",
-  displayTop = true,
+  displayTop = false,
   displayBottom = true
 }) => Content => theRest => {

[Survived] BooleanLiteral
src/components/Navigation/withNavigation.js:13:19
   iconColor = "white",
   topNavColor = "black",
   displayTop = true,
-  displayBottom = true
+  displayBottom = false
 }) => Content => theRest => {
   

[Survived] LogicalOperator
src/components/Navigation/withNavigation.js:21:5
   // and the height taken from the nav bars
   const contentHeight =
     // if both nav bars are shown
-    displayTop && displayBottom
+    displayTop || displayBottom
       ? "calc(100vh - (100px))"
       : // if only one nav bar is shown

[Survived] ConditionalExpression
src/components/Navigation/withNavigation.js:21:5
   // and the height taken from the nav bars
   const contentHeight =
     // if both nav bars are shown
-    displayTop && displayBottom
+    true
       ? "calc(100vh - (100px))"
       : // if only one nav bar is shown

[Survived] BooleanLiteral
src/components/Navigation/withNavigation.js:24:58
     displayTop && displayBottom
       ? "calc(100vh - (100px))"
       : // if only one nav bar is shown
-        (!displayTop && displayBottom) || (displayTop && !displayBottom)
+        (!displayTop && displayBottom) || (displayTop && displayBottom)
         ? "calc(100vh - (50px))"
         : // if neither nav bar is shown

[Survived] ConditionalExpression
src/components/Navigation/withNavigation.js:24:44
     displayTop && displayBottom
       ? "calc(100vh - (100px))"
       : // if only one nav bar is shown
-        (!displayTop && displayBottom) || (displayTop && !displayBottom)
+        (!displayTop && displayBottom) || (true)
         ? "calc(100vh - (50px))"
         : // if neither nav bar is shown

[Survived] StringLiteral
src/components/Navigation/withNavigation.js:27:11
         (!displayTop && displayBottom) || (displayTop && !displayBottom)
         ? "calc(100vh - (50px))"
         : // if neither nav bar is shown
-          "100vh";
+          // if neither nav bar is shown
+"";
 
   return (
