[Killed] BlockStatement
src/components/Onboarding/TopBar.js:6:24
 import { BackSVG } from "../Global/icons";
 import { Row, Col } from "./styles";
 
-function TopBar(props) {
-  // This is our current tob bar component that will take use back to last page
-  // Will be replaced by HOC
-  const handleClick = () => {
-    props.history.goBack();
-  };
-
-  return (
-    <Row className="fixed-top" height="50px">
-      <Col
-        justify="center"
-        align="center"
-        style={{ flex: "0 0 50px" }}
-        onClick={handleClick}
-      >
-        <BackSVG />
-      </Col>
-      <Col justify="flex-start">
-        <PageTitle>{props.title}</PageTitle>
-      </Col>
-    </Row>
-  );
-}
+function TopBar(props) {}
 
 const PageTitle = styled.h1`

[Survived] BlockStatement
src/components/Onboarding/TopBar.js:9:29
 function TopBar(props) {
   // This is our current tob bar component that will take use back to last page
   // Will be replaced by HOC
-  const handleClick = () => {
-    props.history.goBack();
-  };
+  const handleClick = () => {};
 
   return (
