[Survived] BlockStatement
components/Onboarding/components/ActivityLevel.js:19:40
   const { history, path } = props;
 
   // Handles update action on click
-  const handleClick = activityLevel => {
-    // We are using the dispatch we set up with useDispatch to run our update action
-    dispatch(updateActivityLevel(activityLevel));
-
-    // Pushing our path to the next route after action has been dispatched
-    history.push(`${path}/basic-info`);
-  };
+  const handleClick = activityLevel => {};
 
   // Using the useSelector hook to grab the sex state form our onboarding reducer

[Survived] ConditionalExpression
components/Onboarding/components/ActivityLevel.js:32:7
   const sex = useSelector(state => state.onboarding.sex);
 
   // If previous state isn't there, route back to landing so info can be filled out properly
-  if (!sex) return <Redirect to="/landing" />;
+  if (false) return <Redirect to="/landing" />;
 
   return (

[Survived] ConditionalExpression
components/Onboarding/components/ActivityLevel.js:32:7
   const sex = useSelector(state => state.onboarding.sex);
 
   // If previous state isn't there, route back to landing so info can be filled out properly
-  if (!sex) return <Redirect to="/landing" />;
+  if (true) return <Redirect to="/landing" />;
 
   return (
