[Survived] ObjectLiteral
components/Onboarding/components/BasicInfo.js:10:11
 import { Redirect } from "react-router-dom";
 
 class BasicInfo extends React.Component {
-  state = {
-    date_of_birth: "",
-    feet: 0,
-    inches: 0,
-    weight: 0
-  };
+  state = {};
 
   // Handles basic info to onboarding reducer state

[Survived] BlockStatement
components/Onboarding/components/BasicInfo.js:18:24
   };
 
   // Handles basic info to onboarding reducer state
-  handleSubmit = () => {
-    const { date_of_birth, feet, inches, weight } = this.state;
-
-    // Action to add basic info to onboarding reducer
-    this.props.updateBasicInfo({
-      date_of_birth: date_of_birth,
-      height: heightToMetric(feet, inches),
-      weight: weightToMetic(weight)
-    });
-
-    // pushes us to next route after basic info was updated
-    this.props.history.push(`${this.props.path}/weight-goal`);
-  };
+  handleSubmit = () => {};
 
   handleChange = e => {

[Survived] ObjectLiteral
components/Onboarding/components/BasicInfo.js:22:32
     const { date_of_birth, feet, inches, weight } = this.state;
 
     // Action to add basic info to onboarding reducer
-    this.props.updateBasicInfo({
-      date_of_birth: date_of_birth,
-      height: heightToMetric(feet, inches),
-      weight: weightToMetic(weight)
-    });
+    this.props.updateBasicInfo({});
 
     // pushes us to next route after basic info was updated

[Survived] BlockStatement
components/Onboarding/components/BasicInfo.js:32:23
     this.props.history.push(`${this.props.path}/weight-goal`);
   };
 
-  handleChange = e => {
-    this.setState({
-      [e.target.name]: e.target.value
-    });
-  };
+  handleChange = e => {};
 
   render() {

[Survived] ObjectLiteral
components/Onboarding/components/BasicInfo.js:33:19
   };
 
   handleChange = e => {
-    this.setState({
-      [e.target.name]: e.target.value
-    });
+    this.setState({});
   };
 

[Survived] ConditionalExpression
components/Onboarding/components/BasicInfo.js:40:9
 
   render() {
     // If no data from previous route, sends you back to landing
-    if (!this.props.activityLevel) return <Redirect to="/landing" />;
+    if (true) return <Redirect to="/landing" />;
 
     return (

[Survived] ConditionalExpression
components/Onboarding/components/BasicInfo.js:40:9
 
   render() {
     // If no data from previous route, sends you back to landing
-    if (!this.props.activityLevel) return <Redirect to="/landing" />;
+    if (false) return <Redirect to="/landing" />;
 
     return (

[Survived] BlockStatement
components/Onboarding/components/BasicInfo.js:109:39
 }
 
 // Converts height to centimeters
-function heightToMetric(feet, inches) {
-  const feetInches = feet * 12;
-  const totalInches = feetInches + Number(inches);
-  return Math.round(totalInches * 2.54);
-}
+function heightToMetric(feet, inches) {}
 
 // Converts weight to kilograms

[Survived] ArithmeticOperator
components/Onboarding/components/BasicInfo.js:110:22
 
 // Converts height to centimeters
 function heightToMetric(feet, inches) {
-  const feetInches = feet * 12;
+  const feetInches = feet / 12;
   const totalInches = feetInches + Number(inches);
   return Math.round(totalInches * 2.54);

[Survived] ArithmeticOperator
components/Onboarding/components/BasicInfo.js:111:23
 // Converts height to centimeters
 function heightToMetric(feet, inches) {
   const feetInches = feet * 12;
-  const totalInches = feetInches + Number(inches);
+  const totalInches = feetInches - Number(inches);
   return Math.round(totalInches * 2.54);
 }

[Survived] ArithmeticOperator
components/Onboarding/components/BasicInfo.js:112:21
 function heightToMetric(feet, inches) {
   const feetInches = feet * 12;
   const totalInches = feetInches + Number(inches);
-  return Math.round(totalInches * 2.54);
+  return Math.round(totalInches / 2.54);
 }
 

[Survived] BlockStatement
components/Onboarding/components/BasicInfo.js:116:29
 }
 
 // Converts weight to kilograms
-function weightToMetic(lbs) {
-  return Math.round(lbs * 0.453592);
-}
+function weightToMetic(lbs) {}
 
 const mapStateToProps = state => {

[Survived] ArithmeticOperator
components/Onboarding/components/BasicInfo.js:117:21
 
 // Converts weight to kilograms
 function weightToMetic(lbs) {
-  return Math.round(lbs * 0.453592);
+  return Math.round(lbs / 0.453592);
 }
 

[Survived] BlockStatement
components/Onboarding/components/BasicInfo.js:120:34
   return Math.round(lbs * 0.453592);
 }
 
-const mapStateToProps = state => {
-  return {
-    activityLevel: state.onboarding.activityLevel
-  };
-};
+const mapStateToProps = state => {};
 
 export default connect(mapStateToProps, { updateBasicInfo })(BasicInfo);
