[Survived] BlockStatement
components/Onboarding/components/DietaryGoal.js:13:37
   // this is a functional component so we are going to set useDispatch up
   const dispatch = useDispatch();
 
-  const handleClick = daily_goal => {
-    // using dispatch to run our action
-    dispatch(updateDailyGoal(daily_goal));
-    history.push(`${path}/sex`);
-  };
+  const handleClick = daily_goal => {};
 
   return (
