[Survived] BlockStatement
components/Onboarding/components/InputGroupWithIcon.js:7:37
 import { Input } from "../styles";
 
 // Reusable component for Input groups, just define props you need when you import and your good to go
-const InputGroupWithIcon = props => {
-  const SVGIcon = props.icon;
-  return (
-    <InputGroup
-      style={{
-        marginBottom: "10px"
-      }}
-    >
-      <Input
-        placeholder={props.placeholder}
-        onChange={e => props.handleChange(e)}
-        value={props.value}
-        name={props.name}
-        type={props.type}
-      />
-      <InputGroupAddon addonType="append">
-        <InputGroupText>
-          <SVGIcon />
-        </InputGroupText>
-      </InputGroupAddon>
-    </InputGroup>
-  );
-};
+const InputGroupWithIcon = props => {};
 
 export default InputGroupWithIcon;

[Survived] StringLiteral
components/Onboarding/components/InputGroupWithIcon.js:12:23
   return (
     <InputGroup
       style={{
-        marginBottom: "10px"
+        marginBottom: ""
       }}
     >
