[Survived] BlockStatement
components/Onboarding/components/Sex.js:13:30
   const dispatch = useDispatch();
   const { history, path } = props;
 
-  const handleClick = sex => {
-    // using dispatch to run our action
-    dispatch(updateSex(sex));
-
-    // pushing to next route once action has been dispatched
-    history.push(`${path}/activity-level`);
-  };
+  const handleClick = sex => {};
 
   return (
