[Survived] BlockStatement
components/Onboarding/components/WeightGoal.js:28:24
   };
 
   // handles adding target rate and date to redux
-  handleSubmit = () => {
-    const { target_rate, target_weight } = this.state;
-    this.props.updateWeightGoal({
-      target_weight_kg: weightToMetic(target_weight),
-      target_rate: Number(target_rate)
-    });
-    this.props.history.push("/register");
-  };
+  handleSubmit = () => {};
 
   // This function can handle change, can you?

[Survived] ObjectLiteral
components/Onboarding/components/WeightGoal.js:30:33
   // handles adding target rate and date to redux
   handleSubmit = () => {
     const { target_rate, target_weight } = this.state;
-    this.props.updateWeightGoal({
-      target_weight_kg: weightToMetic(target_weight),
-      target_rate: Number(target_rate)
-    });
+    this.props.updateWeightGoal({});
     this.props.history.push("/register");
   };

[Survived] StringLiteral
components/Onboarding/components/WeightGoal.js:34:29
       target_weight_kg: weightToMetic(target_weight),
       target_rate: Number(target_rate)
     });
-    this.props.history.push("/register");
+    this.props.history.push("");
   };
 

[Survived] BlockStatement
components/Onboarding/components/WeightGoal.js:38:23
   };
 
   // This function can handle change, can you?
-  handleChange = e => {
-    this.setState({
-      [e.target.name]: e.target.value
-    });
-  };
+  handleChange = e => {};
 
   render() {

[Survived] BooleanLiteral
components/Onboarding/components/WeightGoal.js:50:37
 
     // takes us back home if we are missing values for height, weight, and dob
     // if they aren't present then it will route to landing so onboarding can be filled out properly
-    if (!weight_kg || !height_cm || !date_of_birth)
+    if (!weight_kg || !height_cm || date_of_birth)
       return <Redirect to="/landing" />;
 

[Survived] ConditionalExpression
components/Onboarding/components/WeightGoal.js:50:9
 
     // takes us back home if we are missing values for height, weight, and dob
     // if they aren't present then it will route to landing so onboarding can be filled out properly
-    if (!weight_kg || !height_cm || !date_of_birth)
+    if (true)
       return <Redirect to="/landing" />;
 

[Survived] UnaryOperator
components/Onboarding/components/WeightGoal.js:79:24
                 <Input
                   name="target_rate"
                   type="range"
-                  min={-2}
+                  min={+2}
                   max={2}
                   step={0.5}

[Survived] ConditionalExpression
components/Onboarding/components/WeightGoal.js:85:20
                   onChange={this.handleChange}
                 />
                 <div>
-                  {this.state.target_rate === 0
+                  {true
                     ? "Maintain"
                     : this.state.target_rate > 0

[Survived] EqualityOperator
components/Onboarding/components/WeightGoal.js:85:20
                   onChange={this.handleChange}
                 />
                 <div>
-                  {this.state.target_rate === 0
+                  {this.state.target_rate !== 0
                     ? "Maintain"
                     : this.state.target_rate > 0

[Survived] ConditionalExpression
components/Onboarding/components/WeightGoal.js:87:23
                 <div>
                   {this.state.target_rate === 0
                     ? "Maintain"
-                    : this.state.target_rate > 0
+                    : false
                     ? `Gain ${this.state.target_rate} pounds per week`
                     : this.state.target_rate < 0

[Survived] EqualityOperator
components/Onboarding/components/WeightGoal.js:87:23
                 <div>
                   {this.state.target_rate === 0
                     ? "Maintain"
-                    : this.state.target_rate > 0
+                    : this.state.target_rate >= 0
                     ? `Gain ${this.state.target_rate} pounds per week`
                     : this.state.target_rate < 0

[Survived] StringLiteral
components/Onboarding/components/WeightGoal.js:88:23
                   {this.state.target_rate === 0
                     ? "Maintain"
                     : this.state.target_rate > 0
-                    ? `Gain ${this.state.target_rate} pounds per week`
+                    ? ""
                     : this.state.target_rate < 0
                     ? `Loose ${this.state.target_rate} pounds per week`

[Survived] ConditionalExpression
components/Onboarding/components/WeightGoal.js:89:23
                     ? "Maintain"
                     : this.state.target_rate > 0
                     ? `Gain ${this.state.target_rate} pounds per week`
-                    : this.state.target_rate < 0
+                    : true
                     ? `Loose ${this.state.target_rate} pounds per week`
                     : "Maintain"}

[Survived] ConditionalExpression
components/Onboarding/components/WeightGoal.js:89:23
                     ? "Maintain"
                     : this.state.target_rate > 0
                     ? `Gain ${this.state.target_rate} pounds per week`
-                    : this.state.target_rate < 0
+                    : false
                     ? `Loose ${this.state.target_rate} pounds per week`
                     : "Maintain"}

[Survived] StringLiteral
components/Onboarding/components/WeightGoal.js:90:23
                     : this.state.target_rate > 0
                     ? `Gain ${this.state.target_rate} pounds per week`
                     : this.state.target_rate < 0
-                    ? `Loose ${this.state.target_rate} pounds per week`
+                    ? ""
                     : "Maintain"}
                 </div>

[Survived] BlockStatement
components/Onboarding/components/WeightGoal.js:109:29
   }
 }
 
-function weightToMetic(lbs) {
-  return Math.round(lbs * 0.453592);
-}
+function weightToMetic(lbs) {}
 
 const mapStateToProps = state => {

[Survived] BlockStatement
components/Onboarding/components/WeightGoal.js:113:34
   return Math.round(lbs * 0.453592);
 }
 
-const mapStateToProps = state => {
-  return {
-    weight_kg: state.onboarding.weight_kg,
-    height_cm: state.onboarding.height_cm,
-    date_of_birth: state.onboarding.date_of_birth
-  };
-};
+const mapStateToProps = state => {};
 
 export default connect(mapStateToProps, { updateWeightGoal })(WeightGoal);

[Survived] ObjectLiteral
components/Onboarding/components/WeightGoal.js:114:10
 }
 
 const mapStateToProps = state => {
-  return {
-    weight_kg: state.onboarding.weight_kg,
-    height_cm: state.onboarding.height_cm,
-    date_of_birth: state.onboarding.date_of_birth
-  };
+  return {};
 };
 
