[Survived] BooleanLiteral
src/components/Onboarding/index.js:24:42
     console.log("[Onboarding index.js] this.state", this.state);
 
     return (
-      <Container justify="center" fluid={true}>
+      <Container justify="center" fluid={false}>
         <TopBar {...this.props} />
         {/* <Route

[Survived] StringLiteral
src/components/Onboarding/index.js:35:17
           render={props => <Sex {...props} path={path} />}
         />
         <Route
-          path={`${path}/activity-level`}
+          path={""}
           render={props => <ActivityLevel {...props} path={path} />}
         />
