[Survived] StringLiteral
src/components/Onboarding/styles.js:18:48
 
 export const Row = styled(BS_Row)`
   ${props => theme.mixin.flex(props.direction, props.justify, props.align)}
-  height: ${({ height }) => (height ? height : "auto")};
+  height: ${({ height }) => (height ? height : "")};
 `;
 

[Survived] StringLiteral
src/components/Onboarding/styles.js:27:48
 
 export const Input = styled(BS_Input)`
   font-size: 1.6rem;
-  height: ${({ height }) => (height ? height : "38px")};
+  height: ${({ height }) => (height ? height : "")};
 `;
 
