[Survived] BlockStatement
src/components/PrivateRoute/index.js:9:66
 
 import { Route, Redirect } from "react-router-dom";
 
-const PrivateRoute = ({ component: RouteComponent, ...rest }) => {
-  // using useSelector to await the token to mount then assigning that to our token variable
-  // when the page rerenders or refreshes all of the firebase data refreshes as well
-  // using async await here makes sure nothing funny happens when we refresh the page
-  const token = useSelector(
-    async state =>
-      (await state.firebase.auth.stsTokenManager) &&
-      state.firebase.auth.stsTokenManager.accessToken
-  );
-
-  return (
-    <Route
-      {...rest}
-      render={routeProps =>
-        // if use is logged in, send them to private route, else send them to the landing page to log in
-        token ? <RouteComponent {...routeProps} /> : <Redirect to="/landing" />
-      }
-    />
-  );
-};
+const PrivateRoute = ({ component: RouteComponent, ...rest }) => {};
 
 export default PrivateRoute;

[Survived] ConditionalExpression
src/components/PrivateRoute/index.js:15:7
   // using async await here makes sure nothing funny happens when we refresh the page
   const token = useSelector(
     async state =>
-      (await state.firebase.auth.stsTokenManager) &&
-      state.firebase.auth.stsTokenManager.accessToken
+      true
   );
 

[Survived] ConditionalExpression
src/components/PrivateRoute/index.js:15:7
   // using async await here makes sure nothing funny happens when we refresh the page
   const token = useSelector(
     async state =>
-      (await state.firebase.auth.stsTokenManager) &&
-      state.firebase.auth.stsTokenManager.accessToken
+      false
   );
 
