[Survived] BooleanLiteral
project/nutrition-tracker-fe/src/index.js:34:27
 
 const reactReduxFirebaseConfig = {
   userProfile: "users",
-  useFirestoreForProfile: false,
+  useFirestoreForProfile: true,
   attachAuthIsReady: true
 };

[Survived] BooleanLiteral
project/nutrition-tracker-fe/src/index.js:35:22
 const reactReduxFirebaseConfig = {
   userProfile: "users",
   useFirestoreForProfile: false,
-  attachAuthIsReady: true
+  attachAuthIsReady: false
 };
 
