[Survived] LogicalOperator
project/nutrition-tracker-fe/src/serviceWorker.js:14:3
 // opt-in, read https://bit.ly/CRA-PWA
 
 const isLocalhost = Boolean(
-  window.location.hostname === 'localhost' ||
-    // [::1] is the IPv6 localhost address.
-    window.location.hostname === '[::1]' ||
-    // 127.0.0.1/8 is considered localhost for IPv4.
-    window.location.hostname.match(
-      /^127(?:\.(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)){3}$/
-    )
+  (window.location.hostname === 'localhost' || // [::1] is the IPv6 localhost address.
+window.location.hostname === '[::1]') && // 127.0.0.1/8 is considered localhost for IPv4.
+window.location.hostname.match(/^127(?:\.(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)){3}$/)
 );
 

[Survived] ConditionalExpression
project/nutrition-tracker-fe/src/serviceWorker.js:16:5
 const isLocalhost = Boolean(
   window.location.hostname === 'localhost' ||
     // [::1] is the IPv6 localhost address.
-    window.location.hostname === '[::1]' ||
+    // [::1] is the IPv6 localhost address.
+true ||
     // 127.0.0.1/8 is considered localhost for IPv4.
     window.location.hostname.match(

[Survived] LogicalOperator
project/nutrition-tracker-fe/src/serviceWorker.js:108:9
       // Ensure service worker exists, and that we really are getting a JS file.
       const contentType = response.headers.get('content-type');
       if (
-        response.status === 404 ||
-        (contentType != null && contentType.indexOf('javascript') === -1)
+        response.status === 404 && contentType != null && contentType.indexOf('javascript') === -1
       ) {
         // No service worker found. Probably a different app. Reload the page.
