[Survived] BlockStatement
project/nutrition-tracker-fe/src/setupTests.js:9:62
 // To find out
 configure({ adapter: new Adapter() });
 
-function _bigMockStore_(initialState = {}, middlewares = []) {
-  // Global variables should have a _ at the beginning and at the end
-  const mockStore = configureStore([...middlewares, thunk]);
-  return mockStore(initialState);
-}
+function _bigMockStore_(initialState = {}, middlewares = []) {}
 
 global._bigMockStore_ = _bigMockStore_;
