[Survived] StringLiteral
src/store/actions/foodItemAction.js:4:30
 import axiosWithAuth from "./AxiosWithAuth";
 
 export const FETCH_START = "FETCH_START";
-export const FETCH_SUCCESS = "FETCH_SUCCESS";
+export const FETCH_SUCCESS = "";
 
 export const getOneEvent = food_id => dispatch => {

[Survived] BlockStatement
src/store/actions/foodItemAction.js:6:51
 export const FETCH_START = "FETCH_START";
 export const FETCH_SUCCESS = "FETCH_SUCCESS";
 
-export const getOneEvent = food_id => dispatch => {
-  dispatch({ type: FETCH_START });
-  axiosWithAuth()
-    .get(`https://corporate-event-planner.herokuapp.com/events/${food_id}`)
-    .then(event => {
-      dispatch({ type: FETCH_SUCCESS, payload: event.data });
-    })
-    .catch(error => {
-      console.log("catch error", error.response);
-    });
-};
+export const getOneEvent = food_id => dispatch => {};
 

[Survived] BlockStatement
src/store/actions/foodItemAction.js:10:20
   dispatch({ type: FETCH_START });
   axiosWithAuth()
     .get(`https://corporate-event-planner.herokuapp.com/events/${food_id}`)
-    .then(event => {
-      dispatch({ type: FETCH_SUCCESS, payload: event.data });
-    })
+    .then(event => {})
     .catch(error => {
       console.log("catch error", error.response);

[Survived] ObjectLiteral
src/store/actions/foodItemAction.js:11:16
   axiosWithAuth()
     .get(`https://corporate-event-planner.herokuapp.com/events/${food_id}`)
     .then(event => {
-      dispatch({ type: FETCH_SUCCESS, payload: event.data });
+      dispatch({});
     })
     .catch(error => {

[Survived] BlockStatement
src/store/actions/foodItemAction.js:13:21
     .then(event => {
       dispatch({ type: FETCH_SUCCESS, payload: event.data });
     })
-    .catch(error => {
-      console.log("catch error", error.response);
-    });
+    .catch(error => {});
 };
 
