[Survived] StringLiteral
src/store/actions/onboardingActions.js:4:23
 export const UPDATE_DAILY_GOAL = "UPDATE_DAILY_GOAL",
   UPDATE_SEX = "UPDATE_SEX",
   UPDATE_ACTIVITY_LEVEL = "UPDATE_ACTIVITY_LEVEL",
-  UPDATE_BASIC_INFO = "UPDATE_BASIC_INFO",
+  UPDATE_BASIC_INFO = "",
   UPDATE_WEIGHT_GOAL = "UPDATE_WEIGHT_GOAL";
 

[Survived] BlockStatement
src/store/actions/onboardingActions.js:7:58
   UPDATE_BASIC_INFO = "UPDATE_BASIC_INFO",
   UPDATE_WEIGHT_GOAL = "UPDATE_WEIGHT_GOAL";
 
-export const updateDailyGoal = daily_goal => dispatch => {
-  dispatch({
-    type: UPDATE_DAILY_GOAL,
-    payload: daily_goal
-  });
-};
+export const updateDailyGoal = daily_goal => dispatch => {};
 
 export const updateSex = sex => dispatch => {

[Survived] BlockStatement
src/store/actions/onboardingActions.js:14:45
   });
 };
 
-export const updateSex = sex => dispatch => {
-  dispatch({
-    type: UPDATE_SEX,
-    payload: sex
-  });
-};
+export const updateSex = sex => dispatch => {};
 
 export const updateActivityLevel = activityLevel => dispatch => {

[Survived] BlockStatement
src/store/actions/onboardingActions.js:21:65
   });
 };
 
-export const updateActivityLevel = activityLevel => dispatch => {
-  dispatch({
-    type: UPDATE_ACTIVITY_LEVEL,
-    payload: activityLevel
-  });
-};
+export const updateActivityLevel = activityLevel => dispatch => {};
 
 export const updateBasicInfo = ({

[Survived] BlockStatement
src/store/actions/onboardingActions.js:32:19
   date_of_birth,
   height,
   weight
-}) => dispatch => {
-  dispatch({
-    type: UPDATE_BASIC_INFO,
-    payload: {
-      date_of_birth: date_of_birth,
-      height: height,
-      weight: weight
-    }
-  });
-};
+}) => dispatch => {};
 
 export const updateWeightGoal = ({

[Survived] BlockStatement
src/store/actions/onboardingActions.js:47:19
   target_weight_kg,
   target_date,
   target_rate
-}) => dispatch => {
-  dispatch({
-    type: UPDATE_WEIGHT_GOAL,
-    payload: {
-      target_weight_kg: target_weight_kg,
-      target_date: target_date,
-      target_rate: target_rate
-    }
-  });
-};
+}) => dispatch => {};
 

[Survived] ObjectLiteral
src/store/actions/onboardingActions.js:50:14
 }) => dispatch => {
   dispatch({
     type: UPDATE_WEIGHT_GOAL,
-    payload: {
-      target_weight_kg: target_weight_kg,
-      target_date: target_date,
-      target_rate: target_rate
-    }
+    payload: {}
   });
 };
