[Survived] BlockStatement
src/store/actions/updateUserSettings.js:3:62
 import axios from "axios";
 
-export const updateUserSettings = settingsObj => dispatch => {
-  dispatch({ type: "UPDATE_SETTINGS_START" });
-  axios
-    .put(`url goes here`, settingsObj)
-    .then(res => {
-      dispatch({
-        type: "UPDATE_SETTINGS_SUCCESS",
-        payload: {
-          height: res.height,
-          weight: res.weight
-        }
-      });
-    })
-    .catch(err =>
-      dispatch({ type: "UPDATE_SETTINGS_FAILURE", payload: err.message })
-    );
-};
+export const updateUserSettings = settingsObj => dispatch => {};
 

[Survived] BlockStatement
src/store/actions/updateUserSettings.js:7:18
   dispatch({ type: "UPDATE_SETTINGS_START" });
   axios
     .put(`url goes here`, settingsObj)
-    .then(res => {
-      dispatch({
-        type: "UPDATE_SETTINGS_SUCCESS",
-        payload: {
-          height: res.height,
-          weight: res.weight
-        }
-      });
-    })
+    .then(res => {})
     .catch(err =>
       dispatch({ type: "UPDATE_SETTINGS_FAILURE", payload: err.message })

[Survived] ObjectLiteral
src/store/actions/updateUserSettings.js:8:16
   axios
     .put(`url goes here`, settingsObj)
     .then(res => {
-      dispatch({
-        type: "UPDATE_SETTINGS_SUCCESS",
-        payload: {
-          height: res.height,
-          weight: res.weight
-        }
-      });
+      dispatch({});
     })
     .catch(err =>

[Survived] StringLiteral
src/store/actions/updateUserSettings.js:9:15
     .put(`url goes here`, settingsObj)
     .then(res => {
       dispatch({
-        type: "UPDATE_SETTINGS_SUCCESS",
+        type: "",
         payload: {
           height: res.height,

[Survived] ObjectLiteral
src/store/actions/updateUserSettings.js:10:18
     .then(res => {
       dispatch({
         type: "UPDATE_SETTINGS_SUCCESS",
-        payload: {
-          height: res.height,
-          weight: res.weight
-        }
+        payload: {}
       });
     })

[Survived] StringLiteral
src/store/actions/updateUserSettings.js:17:24
       });
     })
     .catch(err =>
-      dispatch({ type: "UPDATE_SETTINGS_FAILURE", payload: err.message })
+      dispatch({ type: "", payload: err.message })
     );
 };
