[Survived] ObjectLiteral
src/store/reducers/index.js:7:32
 import { onboardingReducer } from "./onboardingReducer";
 import { updateUserSettings } from "./updateUserSettings";
 
-export default combineReducers({
-  // myCustomAuth: firebaseAuth,
-  firebase: firebaseReducer,
-  onboarding: onboardingReducer,
-  updateSettings: updateUserSettings
-});
+export default combineReducers({});
 
