[Survived] BooleanLiteral
src/store/reducers/initialState.js:6:12
   error: [],
   items: [],
   item: [],
-  getting: false,
+  getting: true,
   got: false,
   adding: false,

[Survived] BooleanLiteral
src/store/reducers/initialState.js:7:8
   items: [],
   item: [],
   getting: false,
-  got: false,
+  got: true,
   adding: false,
   added: false,

[Survived] BooleanLiteral
src/store/reducers/initialState.js:8:11
   item: [],
   getting: false,
   got: false,
-  adding: false,
+  adding: true,
   added: false,
   updating: false,

[Survived] BooleanLiteral
src/store/reducers/initialState.js:9:10
   getting: false,
   got: false,
   adding: false,
-  added: false,
+  added: true,
   updating: false,
   updated: false,

[Survived] BooleanLiteral
src/store/reducers/initialState.js:10:13
   got: false,
   adding: false,
   added: false,
-  updating: false,
+  updating: true,
   updated: false,
   deleting: false,

[Survived] BooleanLiteral
src/store/reducers/initialState.js:11:12
   adding: false,
   added: false,
   updating: false,
-  updated: false,
+  updated: true,
   deleting: false,
   deleted: false

[Survived] BooleanLiteral
src/store/reducers/initialState.js:12:13
   added: false,
   updating: false,
   updated: false,
-  deleting: false,
+  deleting: true,
   deleted: false
 };

[Survived] BooleanLiteral
src/store/reducers/initialState.js:13:12
   updating: false,
   updated: false,
   deleting: false,
-  deleted: false
+  deleted: true
 };
 
