[Survived] StringLiteral
src/store/reducers/onboardingReducer.js:10:15
 } from "../actions/onboardingActions";
 
 export const initialState = {
-  daily_goal: "",
+  daily_goal: "Stryker was here!",
   sex: "",
   weight_kg: 0,

[Survived] StringLiteral
src/store/reducers/onboardingReducer.js:11:8
 
 export const initialState = {
   daily_goal: "",
-  sex: "",
+  sex: "Stryker was here!",
   weight_kg: 0,
   height_cm: 0,

[Survived] BlockStatement
src/store/reducers/onboardingReducer.js:22:29
 
 export const onboardingReducer = (state = initialState, action) => {
   switch (action.type) {
-    case UPDATE_DAILY_GOAL: {
-      return {
-        ...state,
-        daily_goal: action.payload
-      };
-    }
+    case UPDATE_DAILY_GOAL: {}
 
     case UPDATE_SEX: {

[Survived] ConditionalExpression
src/store/reducers/onboardingReducer.js:22:5
 
 export const onboardingReducer = (state = initialState, action) => {
   switch (action.type) {
-    case UPDATE_DAILY_GOAL: {
-      return {
-        ...state,
-        daily_goal: action.payload
-      };
-    }
+    case UPDATE_DAILY_GOAL:
 
     case UPDATE_SEX: {

[Survived] ObjectLiteral
src/store/reducers/onboardingReducer.js:23:14
 export const onboardingReducer = (state = initialState, action) => {
   switch (action.type) {
     case UPDATE_DAILY_GOAL: {
-      return {
-        ...state,
-        daily_goal: action.payload
-      };
+      return {};
     }
 

[Survived] BlockStatement
src/store/reducers/onboardingReducer.js:29:22
       };
     }
 
-    case UPDATE_SEX: {
-      return {
-        ...state,
-        sex: action.payload
-      };
-    }
+    case UPDATE_SEX: {}
 
     case UPDATE_ACTIVITY_LEVEL: {

[Survived] ConditionalExpression
src/store/reducers/onboardingReducer.js:29:5
       };
     }
 
-    case UPDATE_SEX: {
-      return {
-        ...state,
-        sex: action.payload
-      };
-    }
+    case UPDATE_SEX:
 
     case UPDATE_ACTIVITY_LEVEL: {

[Survived] ObjectLiteral
src/store/reducers/onboardingReducer.js:30:14
     }
 
     case UPDATE_SEX: {
-      return {
-        ...state,
-        sex: action.payload
-      };
+      return {};
     }
 

[Survived] BlockStatement
src/store/reducers/onboardingReducer.js:36:33
       };
     }
 
-    case UPDATE_ACTIVITY_LEVEL: {
-      return {
-        ...state,
-        activityLevel: action.payload
-      };
-    }
+    case UPDATE_ACTIVITY_LEVEL: {}
 
     case UPDATE_BASIC_INFO: {

[Survived] ConditionalExpression
src/store/reducers/onboardingReducer.js:36:5
       };
     }
 
-    case UPDATE_ACTIVITY_LEVEL: {
-      return {
-        ...state,
-        activityLevel: action.payload
-      };
-    }
+    case UPDATE_ACTIVITY_LEVEL:
 
     case UPDATE_BASIC_INFO: {

[Survived] ObjectLiteral
src/store/reducers/onboardingReducer.js:37:14
     }
 
     case UPDATE_ACTIVITY_LEVEL: {
-      return {
-        ...state,
-        activityLevel: action.payload
-      };
+      return {};
     }
 

[Survived] ConditionalExpression
src/store/reducers/onboardingReducer.js:43:5
       };
     }
 
-    case UPDATE_BASIC_INFO: {
-      const { date_of_birth, height, weight } = action.payload;
-      return {
-        ...state,
-        date_of_birth: date_of_birth,
-        height_cm: height,
-        weight_kg: weight
-      };
-    }
+    case UPDATE_BASIC_INFO:
 
     case UPDATE_WEIGHT_GOAL: {

[Survived] BlockStatement
src/store/reducers/onboardingReducer.js:43:29
       };
     }
 
-    case UPDATE_BASIC_INFO: {
-      const { date_of_birth, height, weight } = action.payload;
-      return {
-        ...state,
-        date_of_birth: date_of_birth,
-        height_cm: height,
-        weight_kg: weight
-      };
-    }
+    case UPDATE_BASIC_INFO: {}
 
     case UPDATE_WEIGHT_GOAL: {

[Survived] ConditionalExpression
src/store/reducers/onboardingReducer.js:53:5
       };
     }
 
-    case UPDATE_WEIGHT_GOAL: {
-      const { target_weight_kg, target_date, target_rate } = action.payload;
-      return {
-        ...state,
-        target_weight_kg: target_weight_kg,
-        target_date: target_date,
-        target_rate: target_rate
-      };
-    }
+    case UPDATE_WEIGHT_GOAL:
 
     default:

[Survived] BlockStatement
src/store/reducers/onboardingReducer.js:53:30
       };
     }
 
-    case UPDATE_WEIGHT_GOAL: {
-      const { target_weight_kg, target_date, target_rate } = action.payload;
-      return {
-        ...state,
-        target_weight_kg: target_weight_kg,
-        target_date: target_date,
-        target_rate: target_rate
-      };
-    }
+    case UPDATE_WEIGHT_GOAL: {}
 
     default:

[Survived] ConditionalExpression
src/store/reducers/onboardingReducer.js:63:5
       };
     }
 
-    default:
-      return state;
+    default:
   }
 };
