[Survived] ObjectLiteral
src/store/reducers/updateUserSettings.js:1:22
-const initialState = {
-  height: "",
-  weight: ""
-};
+const initialState = {};
 
 export const updateUserSettings = (state = initialState, action) => {

[Survived] StringLiteral
src/store/reducers/updateUserSettings.js:3:11
 const initialState = {
   height: "",
-  weight: ""
+  weight: "Stryker was here!"
 };
 

[Survived] ConditionalExpression
src/store/reducers/updateUserSettings.js:8:5
 
 export const updateUserSettings = (state = initialState, action) => {
   switch (action.type) {
-    case "UPDATE_SETTINGS_START": {
-      return {
-        ...state
-      };
-    }
+    case "UPDATE_SETTINGS_START":
 
     case "UPDATE_SETTINGS_SUCCESS": {

[Survived] BlockStatement
src/store/reducers/updateUserSettings.js:8:35
 
 export const updateUserSettings = (state = initialState, action) => {
   switch (action.type) {
-    case "UPDATE_SETTINGS_START": {
-      return {
-        ...state
-      };
-    }
+    case "UPDATE_SETTINGS_START": {}
 
     case "UPDATE_SETTINGS_SUCCESS": {

[Survived] BlockStatement
src/store/reducers/updateUserSettings.js:14:37
       };
     }
 
-    case "UPDATE_SETTINGS_SUCCESS": {
-      const { height, weight } = action.payload;
-      return {
-        ...state,
-        height: height,
-        weight: weight
-      };
-    }
+    case "UPDATE_SETTINGS_SUCCESS": {}
 
     case "UPDATE_SETTINGS_FAILURE": {

[Survived] ConditionalExpression
src/store/reducers/updateUserSettings.js:14:5
       };
     }
 
-    case "UPDATE_SETTINGS_SUCCESS": {
-      const { height, weight } = action.payload;
-      return {
-        ...state,
-        height: height,
-        weight: weight
-      };
-    }
+    case "UPDATE_SETTINGS_SUCCESS":
 
     case "UPDATE_SETTINGS_FAILURE": {

[Survived] ConditionalExpression
src/store/reducers/updateUserSettings.js:23:5
       };
     }
 
-    case "UPDATE_SETTINGS_FAILURE": {
-      return {
-        ...state
-      };
-    }
+    case "UPDATE_SETTINGS_FAILURE":
 
     default:

[Survived] BlockStatement
src/store/reducers/updateUserSettings.js:23:37
       };
     }
 
-    case "UPDATE_SETTINGS_FAILURE": {
-      return {
-        ...state
-      };
-    }
+    case "UPDATE_SETTINGS_FAILURE": {}
 
     default:
